MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNHGFB/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBL0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBL1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBL2;
	char           wk21[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CLR0 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR31 : 1;
#else
			unsigned long CLR31 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR0 : 1;
#endif
	} BIT;
	} GCRBE0;
	char           wk22[124];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR5;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR6;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR8;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR9;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBRA;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBRB;
	char           wk23[116];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR128;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR129;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR130;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR131;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR132;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR133;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR134;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR135;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR136;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR137;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR138;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR139;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR140;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR141;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR142;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBXR143;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR144;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR145;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR146;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR147;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR148;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR149;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR150;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR151;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR152;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR153;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR154;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR155;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR156;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR157;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR158;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR159;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR160;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR161;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR162;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR163;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR164;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR165;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR166;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR167;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR168;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR169;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR170;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR171;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR172;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR173;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR174;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR175;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR176;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR177;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR178;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR179;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR180;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR181;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR182;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR183;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR184;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR185;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR186;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR187;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR188;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR189;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLI : 8;
#else
			unsigned char SLI : 8;
#endif
	} BIT;
	} SLIBR190;
	union {
		unsigned char BYTE;
		struct {
			
